# CloudExternalService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..CloudExternalService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which supports get cloud model information from cloud servers such as C4R.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId CloudExternalService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CloudExternalService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ CloudExternalService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace